import time

# รายการข้อความและเวลาหน่วง (เวลาหน่วงเป็นวินาที)
messages = [
    ("\033[36m โชคดีเหลือเกิน ที่เราได้เจอกัน \033[0m", 4),
    ("\033[36m โชคดีที่เธอ ยังยอมอยู่ข้างฉัน \033[0m", 3),
    ("\033[36m ไหนใครว่าเวลาเปลี่ยนไป \033[0m", 3),
    ("\033[36m หัวใจใครๆมักเปลี่ยนแปลง \033[0m", 4),
    ("\033[36m โชคดีเหลือเกิน ที่เรายังมีกัน \033[0m", 3),
    ("\033[36m ทุกช่วงเวลา เธอยังอยู่ข้างฉัน \033[0m", 4),
    ("\033[36m ไหนว่าผู้คนมักเปลี่ยนไป \033[0m", 3),
    ("\033[31m -- โชคดีที่หัวใจ ของเราไม่เคยเปลี่ยนเลย --\033[0m ", 3),
    # เพิ่มข้อความ โดยใช้ ("ข้อความที่จะเพิ่ม", เวลาหน่วง 3 วิ),
]

# กำหนดความเร็วการแสดงข้อความ (วินาทีต่อตัวอักษร)
speed = 0.1 # คำเเนะนำ 0.1 เเสดงทีละตัวอักษร 0.0 เเสดงทั้งข้อความ

# วนลูปเพื่อแสดงข้อความทีละตัวอักษร (ห้ามเเก้ไข)
for message, delay in messages:
    for char in message:
        print(char, end='', flush=True)
        time.sleep(speed)
    print()
    time.sleep(delay)
